src_doc/InformationRegisters/ОшибкиЭДОКИсправлению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОшибкиЭДОКИсправлению</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГруппироватьУведомленияПоНастройкам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкиЭДО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьСоглашенияОбИспользованииЭД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеПроблемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УведомлениеОтправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПредметОшибки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументВходящийЭДО</v8:Type>
						<v8:Type>cfg:DocumentRef.СообщениеЭДО</v8:Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_doc/InformationRegisters/ОшибкиЭДОКИсправлению/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПредметОшибки") Тогда
		ПредметОшибки = Параметры.ПредметОшибки;
	КонецЕсли;
	
	ОбновитьДанныеПоПредметуОшибки();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновленоСостояниеЭДДО"
		И Параметр.Свойство("Документы")
		И Параметр.Документы.Найти(ПредметОшибки) <> Неопределено Тогда
		
		ОбновитьДанныеПоПредметуОшибки();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьДанныеПоПредметуОшибки()
	
	ЗаписьОбОшибке = ЗаписьОбОшибкеПоПредмету(ПредметОшибки);
	
	Если ЗаписьОбОшибке <> Неопределено Тогда
		ЗначениеВРеквизитФормы(ЗаписьОбОшибке, "Запись");
		НесуществующаяЗапись = Ложь;
	Иначе
		ЗначениеВРеквизитФормы(РегистрыСведений.ОшибкиЭДОКИсправлению.СоздатьМенеджерЗаписи(), "Запись");
		Запись.ПредметОшибки = ПредметОшибки;
		Запись.ОписаниеПроблемы =
			НСтр("ru = 'Не найдено записи о ошибке обмена по данному предмету.'");
		НесуществующаяЗапись = Истина;
	КонецЕсли;
	
	Если ТипЗнч(ПредметОшибки) = Тип("СправочникСсылка.ДокументыПредприятия") Тогда
		СостояниеЭДО =
			РегистрыСведений.СостояниеДокументовПоЭДО.ДанныеСостоянияДокументаПоЭДО(ПредметОшибки);
	ИначеЕсли ТипЗнч(ПредметОшибки) = Тип("ДокументСсылка.ЭлектронныйДокументВходящийЭДО") Тогда
		ДанныеПоОтражениюДокумента =
			ОбменСКонтрагентамиДОВызовСервера.ДанныеПоОтражениюДокументаЭДО(ПредметОшибки);
		
		ОжидаетАвтоматическогоСоздания = ДанныеПоОтражениюДокумента.ОжидаетАвтоматическогоОтражения;
	КонецЕсли;
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаСервере
Функция ЗаписьОбОшибкеПоПредмету(ПредметОшибки)
	
	Если Не ЗначениеЗаполнено(ПредметОшибки) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ОшибкиЭДОКИсправлению.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ПредметОшибки = ПредметОшибки;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		Возврат МенеджерЗаписи;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	Элементы.НастройкиЭДО.Видимость = ЗначениеЗаполнено(Запись.НастройкиЭДО);
	
	Элементы.ФормаОтмена.Видимость = Ложь;
	
	Если НесуществующаяЗапись Тогда
		Элементы.ФормаОтмена.Видимость = Истина;
	ИначеЕсли ТипЗнч(Запись.ПредметОшибки) = Тип("СправочникСсылка.ДокументыПредприятия") Тогда
		Элементы.ФормаОтмена.Видимость = Истина;
	ИначеЕсли ТипЗнч(Запись.ПредметОшибки) = Тип("ДокументСсылка.ЭлектронныйДокументВходящийЭДО") Тогда
		Элементы.ФормаОтмена.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
